#include "dataGenerator.hpp"

App::DataGenerator::DataGenerator()
{

}

App::DataGenerator::~DataGenerator()
{

}

void App::DataGenerator::generateRectRandomly(Job::MeasuredObj & obj)
{
    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //step1.定义数据的范围

    double xCoordMax = 150.00; //矩形框左上角x坐标距屏幕最大距离150.00
    double xCoordMin = 0.01;   //矩形框左上角x坐标距屏幕最小距离0.01
    double yCoordMax = 150.00; //矩形框左上角y坐标距屏幕最大距离150.00
    double yCoordMin = 0.01;   //矩形框左上角y坐标距屏幕最大距离0.01
    double widthMax  = 100.00; //矩形框宽最大距离100.00
    double widthMin  = 0.01;   //矩形框宽最小距离0.01
    double heightMax = 100.00; //矩形框长最大距离100.00
    double heightMin = 0.01;   //矩形框长最小距离0.01

    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //step2.随机生成数据

    SDK::Rectangle rectangle;

    rectangle.setXCoord(RANDOM_NUM(xCoordMax,xCoordMin));
    rectangle.setYCoord(RANDOM_NUM(yCoordMax,yCoordMin));
    rectangle.setWidth(RANDOM_NUM(widthMax,widthMin));
    rectangle.setHeight(RANDOM_NUM(heightMax,heightMin));

    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //step3.把数据存入obj

    obj.setBody(rectangle);

    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

}

void App::DataGenerator::generateObjsRandomly(int size, Job::MeasuredObj measuredObj[])
{
    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //1.生成size个测量对象数据

    for (int i = 0; i < size; ++i)
    {
        char name[FILE_NAME_LEN];

        //>>>-------------------------------------------------------------------------------------------------------------------------------------
        //1.1 生成每个测量对象的名字

        if(i < IC_CNT)
        {
            sprintf(name,"chip_%.3d",i);
        }
        else
        {
            sprintf(name,"ic_%.3d",i-IC_CNT);
        }

        //>>>-------------------------------------------------------------------------------------------------------------------------------------
        //1.2 把名字赋给测量对象 & 把随机生成的矩形赋给测量对象

        measuredObj[i].setName(name);
        generateRectRandomly(measuredObj[i]);
    }

    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
}

//void App::DataGenerator::generateBoard(Job::Board & board)
//{
//    std::string defaultBoardName = "HUAWEI";
//    board.setMeasuredObjList(defaultBoardName);
//    board.setSizeX(50);
//    board.setSizeY(50);
//    board.setOriginalX(10);
//    board.setOriginalY(10);
//}
